In [1]:
import pandas as pd
import numpy as np

In [2]:
#К нам поступили данные из бухгалтерии о заработках Лупы и Пупы за разные задачи! 
#Посмотрите у кого из них больше средний заработок в различных категориях (колонка Type) 
#и заполните таблицу, указывая исполнителя с большим заработком в каждой из категорий.
salary = pd.read_csv('https://stepik.org/media/attachments/course/4852/accountancy.csv')

In [3]:
salary.head()

   Unnamed: 0 Executor Type  Salary
0           0     Pupa    D      63
1           1     Pupa    A     158
2           2     Pupa    D     194
3           3     Pupa    E     109
4           4    Loopa    E     184

In [4]:
#Получение средних значений по всем типам для Лупы и Пупы
type_salary = salary.groupby(['Type', 'Executor'], as_index=False).aggregate({'Salary' : 'mean'})

In [5]:
#Получение максимальных средних значений по каждой категории
max_salary = type_salary.sort_values(['Type','Salary'], ascending=False).groupby('Type', as_index=False).head(1)

In [6]:
#Сортировка по категории
max_salary.sort_values(['Type'])

   Type Executor      Salary
1     A     Pupa  160.833333
2     B    Loopa  145.166667
4     C    Loopa  154.333333
7     D     Pupa  146.500000
8     E    Loopa  164.000000
10    F    Loopa  238.000000